// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// Фрилунд А.

using static System.Console; 
Clear(); 


int M = 1;
WriteLine("Введите натуральное число: "); 
int N = int.Parse(ReadLine()); 
        for (int i = M; i <= N; i++)
        {
            if (i % 2 == 0) 
            {
                Console.Write(i + " ");
            }
        }

        // не работает с минусовыми, поэтому в запросе указал "натуральное"